_posts/2016-06-16-Learning_Haskell.org.html
---
layout: post
title: Learning Haskell (WIP)
---

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">1</span> Environment Install</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Dependencies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Glasgow Haskell Compiler (GHC) - The compiler for Haskell.
Cabal - Package description format.
Stack - Package management tool.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Get Start</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-shell">brew update <span style="color: #7285b7; font-style: italic;"># </span><span style="color: #7285b7; font-style: italic;">upgrade HomeBrew</span>
brew install haskell-stack <span style="color: #7285b7; font-style: italic;"># </span><span style="color: #7285b7; font-style: italic;">install package management tool Stack</span>
stack new <span style="color: #7285b7; font-style: italic;"># </span><span style="color: #7285b7; font-style: italic;">download Haskell runtime environment</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Emacs Haskell-mode</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-shell">M-x package-refresh-contents
M-x package-install RET haskell-mode
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #d1f1a9;">setq</span> haskell-program-name <span style="color: #99ffff;">"GHCI_PATH"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> Haskell Test</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-haskell">putStrLn "Hello World"
92 `div` 13
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Haskell Features</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Referential Transparency</li>
<li>Type Inference</li>
<li>Lazy</li>
<li>Statically Typed</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">3</span> Basic Rules</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> Define and Evaluate Function</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-haskell">let f x = 1 + x -- Same as define ~f~ in a file and load it using :l
f 2 -- 3
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.2</span> If Expression</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-haskell">let double'Small'Num x = (if x &gt; 100 then x else 2 * x) + 1
double'Small'Num 101 -- 102
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.3</span> List</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-haskell">1 : [2,3] ++ [4,5] ++ [] -- [1,2,3,4,5]
('H' : "ello" ++ " " ++ "World") !! 1 -- 'e'
[3,2,1] &lt;= [3,2,2] -- True
let l = [1,2,3,4]
(tail l) ++ [head l] -- [4,1,2,3]
(last l) : (init l) -- [4,1,2,3]
length l -- 4
null [] -- True
reverse l -- [4,3,2,1]
take 2 l -- [1,2]
drop 2 l -- [3,4]
maximum l -- 4
sum l -- 10
product l -- 24
5 `elem` l -- False
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">3.4</span> Range</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-haskell">[1..4] -- [1,2,3,4]
['a'..'d'] -- "abcd"
[1,3..7] -- [1,3,5,7]
[13,26..4*13] -- [13,26,39,52]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.5</span> List Comprehension</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-haskell">[ x*2 | x&lt;-[1..3], x/=2 ] -- [2,6]
let xxs = [[1..3], [2..4], [3..5]]
[[x | x &lt;- xs, even x] | xs &lt;- xxs] -- [[2], [2,4], [4]]
[x+y | x &lt;- [1..3], y &lt;- [2..5]] -- [3,4,5,6,4,5,6,7,5,6,7,8]
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.6</span> Tuple</h3>
</div>
</div>
